:PROPERTIES:
:ID:       2BD15337-02A4-49FD-BC84-E87A19806C6A
:END:
#+title: org-roamをgitでpullしたとき
#+filetags: :org-roam:

- pushの自動化もしたい
  -> [[id:48C966F2-BE28-43D9-86EE-BC27B2DD63FA][org-roamをpushするとき]]


#+begin_src elisp
  (defun org-roam-pull ()
    (interactive)
    (org-roam-db-clear-all)
    (org-roam-db-sync))
#+end_src

#+RESULTS:
: org-roam-pull

#+begin_src elisp
  (org-roam-pull)
#+end_src

#+RESULTS:

#+begin_src elisp
(org-roam-db-clear-all)
#+end_src

#+RESULTS:

#+begin_src elisp
(print org-roam-directory)
#+end_src

#+RESULTS:
: ~/zettelkasten
